name: "yolov8s"
platform: "onnxruntime_onnx"
max_batch_size: 16
input [
  {
    name: "images"
    data_type: TYPE_FP32
    dims: [ 3, 640, 640 ]
  }
]
output [
  {
    name: "output0"
    data_type: TYPE_FP32
    dims: [ 84, 8400 ]
  }
]

# Dynamic batching configuration for CPU
dynamic_batching {
  max_queue_delay_microseconds: 100000
  preferred_batch_size: [ 4, 8, 16 ]
  max_queue_size: 32
}

# CPU instance group configuration
instance_group [
  {
    count: 2
    kind: KIND_CPU
  }
]

# CPU optimization
optimization {
  execution_accelerators {
    cpu_execution_accelerator : [ {
      name : "onnxruntime"
      parameters { key: "intra_op_num_threads" value: "0" }
      parameters { key: "inter_op_num_threads" value: "0" }
      parameters { key: "optimization_level" value: "all" }
    } ]
  }
}

# Version policy
version_policy: { latest: { num_versions: 1 } }
